is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecm064.h
extern volatile __AD1DATA8bits_t AD1DATA8bits __asm__ ("AD1DATA8") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA9 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA9bits_t;
extern volatile __AD1DATA9bits_t AD1DATA9bits __asm__ ("AD1DATA9") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA10 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA10bits_t;
extern volatile __AD1DATA10bits_t AD1DATA10bits __asm__ ("AD1DATA10") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA11 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA11bits_t;
extern volatile __AD1DATA11bits_t AD1DATA11bits __asm__ ("AD1DATA11") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA12 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA12bits_t;
extern volatile __AD1DATA12bits_t AD1DATA12bits __asm__ ("AD1DATA12") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA13 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA13bits_t;
extern volatile __AD1DATA13bits_t AD1DATA13bits __asm__ ("AD1DATA13") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA14 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA14bits_t;
extern volatile __AD1DATA14bits_t AD1DATA14bits __asm__ ("AD1DATA14") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA15 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA15bits_t;
extern volatile __AD1DATA15bits_t AD1DATA15bits __asm__ ("AD1DATA15") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA16 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA16bits_t;
extern volatile __AD1DATA16bits_t AD1DATA16bits __asm__ ("AD1DATA16") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA17 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA17bits_t;
extern volatile __AD1DATA17bits_t AD1DATA17bits __asm__ ("AD1DATA17") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA18 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA18bits_t;
extern volatile __AD1DATA18bits_t AD1DATA18bits __asm__ ("AD1DATA18") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA43 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA43bits_t;
extern volatile __AD1DATA43bits_t AD1DATA43bits __asm__ ("AD1DATA43") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA44 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA44bits_t;
extern volatile __AD1DATA44bits_t AD1DATA44bits __asm__ ("AD1DATA44") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CAL1 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCAL:32;
} __AD1CAL1bits_t;
extern volatile __AD1CAL1bits_t AD1CAL1bits __asm__ ("AD1CAL1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CAL2 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCAL:32;
} __AD1CAL2bits_t;
extern volatile __AD1CAL2bits_t AD1CAL2bits __asm__ ("AD1CAL2") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CAL3 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCAL:32;
} __AD1CAL3bits_t;
extern volatile __AD1CAL3bits_t AD1CAL3bits __asm__ ("AD1CAL3") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CAL4 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCAL:32;
} __AD1CAL4bits_t;
extern volatile __AD1CAL4bits_t AD1CAL4bits __asm__ ("AD1CAL4") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CAL5 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCAL:32;
} __AD1CAL5bits_t;
extern volatile __AD1CAL5bits_t AD1CAL5bits __asm__ ("AD1CAL5") __attribute__((section("sfrs")));
extern volatile unsigned int        CM1CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CCH:2;
    unsigned :2;
    unsigned CREF:1;
    unsigned :1;
    unsigned EVPOL:2;
    unsigned COUT:1;
    unsigned :4;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned ON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :4;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
  struct {
    unsigned w:32;
  };
} __CM1CONbits_t;
extern volatile __CM1CONbits_t CM1CONbits __asm__ ("CM1CON") __attribute__((section("sfrs")));
extern volatile unsigned int        CM1CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CM1CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CM1CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CM2CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CCH:2;
    unsigned :2;
    unsigned CREF:1;
    unsigned :1;
    unsigned EVPOL:2;
    unsigned COUT:1;
    unsigned :4;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned ON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :4;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
  struct {
    unsigned w:32;
  };
} __CM2CONbits_t;
extern volatile __CM2CONbits_t CM2CONbits __asm__ ("CM2CON") __attribute__((section("sfrs")));
extern volatile unsigned int        CM2CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CM2CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CM2CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CMSTAT __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned C1OUT:1;
    unsigned C2OUT:1;
    unsigned :11;
    unsigned SIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __CMSTATbits_t;
extern volatile __CMSTATbits_t CMSTATbits __asm__ ("CMSTAT") __attribute__((section("sfrs")));
extern volatile unsigned int        CMSTATCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CMSTATSET __attribute__((section("sfrs")));
extern volatile unsigned int        CMSTATINV __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ANSB0:1;
    unsigned ANSB1:1;
    unsigned ANSB2:1;
    unsigned ANSB3:1;
    unsigned ANSB4:1;
    unsigned ANSB5:1;
    unsigned ANSB6:1;
    unsigned ANSB7:1;
    unsigned ANSB8:1;
    unsigned ANSB9:1;
    unsigned ANSB10:1;
    unsigned ANSB11:1;
    unsigned ANSB12:1;
    unsigned ANSB13:1;
    unsigned ANSB14:1;
    unsigned ANSB15:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELBbits_t;
extern volatile __ANSELBbits_t ANSELBbits __asm__ ("ANSELB") __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELBSET __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELBINV __attribute__((section("sfrs")));
extern volatile unsigned int        TRISB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISB0:1;
    unsigned TRISB1:1;
    unsigned TRISB2:1;
    unsigned TRISB3:1;
    unsigned TRISB4:1;
    unsigned TRISB5:1;
    unsigned TRISB6:1;
    unsigned TRISB7:1;
    unsigned TRISB8:1;
    unsigned TRISB9:1;
    unsigned TRISB10:1;
    unsigned TRISB11:1;
    unsigned TRISB12:1;
    unsigned TRISB13:1;
    unsigned TRISB14:1;
    unsigned TRISB15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISBbits_t;
extern volatile __TRISBbits_t TRISBbits __asm__ ("TRISB") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        TRISBSET __attribute__((section("sfrs")));
extern volatile unsigned int        TRISBINV __attribute__((section("sfrs")));
extern volatile unsigned int        PORTB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RB2:1;
    unsigned RB3:1;
    unsigned RB4:1;
    unsigned RB5:1;
    unsigned RB6:1;
    unsigned RB7:1;
    unsigned RB8:1;
    unsigned RB9:1;
    unsigned RB10:1;
    unsigned RB11:1;
    unsigned RB12:1;
    unsigned RB13:1;
    unsigned RB14:1;
    unsigned RB15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTBbits_t;
extern volatile __PORTBbits_t PORTBbits __asm__ ("PORTB") __attribute__((section("sfrs")));
extern volatile unsigned int        PORTBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PORTBSET __attribute__((section("sfrs")));
extern volatile unsigned int        PORTBINV __attribute__((section("sfrs")));
extern volatile unsigned int        LATB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATB0:1;
    unsigned LATB1:1;
    unsigned LATB2:1;
    unsigned LATB3:1;
    unsigned LATB4:1;
    unsigned LATB5:1;
    unsigned LATB6:1;
    unsigned LATB7:1;
    unsigned LATB8:1;
    unsigned LATB9:1;
    unsigned LATB10:1;
    unsigned LATB11:1;
    unsigned LATB12:1;
    unsigned LATB13:1;
    unsigned LATB14:1;
    unsigned LATB15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATBbits_t;
extern volatile __LATBbits_t LATBbits __asm__ ("LATB") __attribute__((section("sfrs")));
extern volatile unsigned int        LATBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        LATBSET __attribute__((section("sfrs")));
extern volatile unsigned int        LATBINV __attribute__((section("sfrs")));
extern volatile unsigned int        ODCB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCB0:1;
    unsigned ODCB1:1;
    unsigned ODCB2:1;
    unsigned ODCB3:1;
    unsigned ODCB4:1;
    unsigned ODCB5:1;
    unsigned ODCB6:1;
    unsigned ODCB7:1;
    unsigned ODCB8:1;
    unsigned ODCB9:1;
    unsigned ODCB10:1;
    unsigned ODCB11:1;
    unsigned ODCB12:1;
    unsigned ODCB13:1;
    unsigned ODCB14:1;
    unsigned ODCB15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCBbits_t;
extern volatile __ODCBbits_t ODCBbits __asm__ ("ODCB") __attribute__((section("sfrs")));
extern volatile unsigned int        ODCBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ODCBSET __attribute__((section("sfrs")));
extern volatile unsigned int        ODCBINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUB0:1;
    unsigned CNPUB1:1;
    unsigned CNPUB2:1;
    unsigned CNPUB3:1;
    unsigned CNPUB4:1;
    unsigned CNPUB5:1;
    unsigned CNPUB6:1;
    unsigned CNPUB7:1;
    unsigned CNPUB8:1;
    unsigned CNPUB9:1;
    unsigned CNPUB10:1;
    unsigned CNPUB11:1;
    unsigned CNPUB12:1;
    unsigned CNPUB13:1;
    unsigned CNPUB14:1;
    unsigned CNPUB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUBbits_t;
extern volatile __CNPUBbits_t CNPUBbits __asm__ ("CNPUB") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUBSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUBINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPDB0:1;
    unsigned CNPDB1:1;
    unsigned CNPDB2:1;
    unsigned CNPDB3:1;
    unsigned CNPDB4:1;
    unsigned CNPDB5:1;
    unsigned CNPDB6:1;
    unsigned CNPDB7:1;
    unsigned CNPDB8:1;
    unsigned CNPDB9:1;
    unsigned CNPDB10:1;
    unsigned CNPDB11:1;
    unsigned CNPDB12:1;
    unsigned CNPDB13:1;
    unsigned CNPDB14:1;
    unsigned CNPDB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDBbits_t;
extern volatile __CNPDBbits_t CNPDBbits __asm__ ("CNPDB") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDBSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDBINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONBbits_t;
