is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecm064.h
#define _OC7CON_ON_POSITION                      0x0000000F
#define _OC7CON_ON_MASK                          0x00008000
#define _OC7CON_ON_LENGTH                        0x00000001

#define _OC7CON_OCM0_POSITION                    0x00000000
#define _OC7CON_OCM0_MASK                        0x00000001
#define _OC7CON_OCM0_LENGTH                      0x00000001

#define _OC7CON_OCM1_POSITION                    0x00000001
#define _OC7CON_OCM1_MASK                        0x00000002
#define _OC7CON_OCM1_LENGTH                      0x00000001

#define _OC7CON_OCM2_POSITION                    0x00000002
#define _OC7CON_OCM2_MASK                        0x00000004
#define _OC7CON_OCM2_LENGTH                      0x00000001

#define _OC7CON_OCSIDL_POSITION                  0x0000000D
#define _OC7CON_OCSIDL_MASK                      0x00002000
#define _OC7CON_OCSIDL_LENGTH                    0x00000001

#define _OC7CON_w_POSITION                       0x00000000
#define _OC7CON_w_MASK                           0xFFFFFFFF
#define _OC7CON_w_LENGTH                         0x00000020

#define _OC8CON_OCM_POSITION                     0x00000000
#define _OC8CON_OCM_MASK                         0x00000007
#define _OC8CON_OCM_LENGTH                       0x00000003

#define _OC8CON_OCTSEL_POSITION                  0x00000003
#define _OC8CON_OCTSEL_MASK                      0x00000008
#define _OC8CON_OCTSEL_LENGTH                    0x00000001

#define _OC8CON_OCFLT_POSITION                   0x00000004
#define _OC8CON_OCFLT_MASK                       0x00000010
#define _OC8CON_OCFLT_LENGTH                     0x00000001

#define _OC8CON_OC32_POSITION                    0x00000005
#define _OC8CON_OC32_MASK                        0x00000020
#define _OC8CON_OC32_LENGTH                      0x00000001

#define _OC8CON_SIDL_POSITION                    0x0000000D
#define _OC8CON_SIDL_MASK                        0x00002000
#define _OC8CON_SIDL_LENGTH                      0x00000001

#define _OC8CON_ON_POSITION                      0x0000000F
#define _OC8CON_ON_MASK                          0x00008000
#define _OC8CON_ON_LENGTH                        0x00000001

#define _OC8CON_OCM0_POSITION                    0x00000000
#define _OC8CON_OCM0_MASK                        0x00000001
#define _OC8CON_OCM0_LENGTH                      0x00000001

#define _OC8CON_OCM1_POSITION                    0x00000001
#define _OC8CON_OCM1_MASK                        0x00000002
#define _OC8CON_OCM1_LENGTH                      0x00000001

#define _OC8CON_OCM2_POSITION                    0x00000002
#define _OC8CON_OCM2_MASK                        0x00000004
#define _OC8CON_OCM2_LENGTH                      0x00000001

#define _OC8CON_OCSIDL_POSITION                  0x0000000D
#define _OC8CON_OCSIDL_MASK                      0x00002000
#define _OC8CON_OCSIDL_LENGTH                    0x00000001

#define _OC8CON_w_POSITION                       0x00000000
#define _OC8CON_w_MASK                           0xFFFFFFFF
#define _OC8CON_w_LENGTH                         0x00000020

#define _OC9CON_OCM_POSITION                     0x00000000
#define _OC9CON_OCM_MASK                         0x00000007
#define _OC9CON_OCM_LENGTH                       0x00000003

#define _OC9CON_OCTSEL_POSITION                  0x00000003
#define _OC9CON_OCTSEL_MASK                      0x00000008
#define _OC9CON_OCTSEL_LENGTH                    0x00000001

#define _OC9CON_OCFLT_POSITION                   0x00000004
#define _OC9CON_OCFLT_MASK                       0x00000010
#define _OC9CON_OCFLT_LENGTH                     0x00000001

#define _OC9CON_OC32_POSITION                    0x00000005
#define _OC9CON_OC32_MASK                        0x00000020
#define _OC9CON_OC32_LENGTH                      0x00000001

#define _OC9CON_SIDL_POSITION                    0x0000000D
#define _OC9CON_SIDL_MASK                        0x00002000
#define _OC9CON_SIDL_LENGTH                      0x00000001

#define _OC9CON_ON_POSITION                      0x0000000F
#define _OC9CON_ON_MASK                          0x00008000
#define _OC9CON_ON_LENGTH                        0x00000001

#define _OC9CON_OCM0_POSITION                    0x00000000
#define _OC9CON_OCM0_MASK                        0x00000001
#define _OC9CON_OCM0_LENGTH                      0x00000001

#define _OC9CON_OCM1_POSITION                    0x00000001
#define _OC9CON_OCM1_MASK                        0x00000002
#define _OC9CON_OCM1_LENGTH                      0x00000001

#define _OC9CON_OCM2_POSITION                    0x00000002
#define _OC9CON_OCM2_MASK                        0x00000004
#define _OC9CON_OCM2_LENGTH                      0x00000001

#define _OC9CON_OCSIDL_POSITION                  0x0000000D
#define _OC9CON_OCSIDL_MASK                      0x00002000
#define _OC9CON_OCSIDL_LENGTH                    0x00000001

#define _OC9CON_w_POSITION                       0x00000000
#define _OC9CON_w_MASK                           0xFFFFFFFF
#define _OC9CON_w_LENGTH                         0x00000020

#define _AD1CON1_FRACT_POSITION                  0x0000000B
#define _AD1CON1_FRACT_MASK                      0x00000800
#define _AD1CON1_FRACT_LENGTH                    0x00000001

#define _AD1CON1_ADSIDL_POSITION                 0x0000000D
#define _AD1CON1_ADSIDL_MASK                     0x00002000
#define _AD1CON1_ADSIDL_LENGTH                   0x00000001

#define _AD1CON1_ADCEN_POSITION                  0x0000000F
#define _AD1CON1_ADCEN_MASK                      0x00008000
#define _AD1CON1_ADCEN_LENGTH                    0x00000001

#define _AD1CON1_EIE_POSITION                    0x00000010
#define _AD1CON1_EIE_MASK                        0x00070000
#define _AD1CON1_EIE_LENGTH                      0x00000003

#define _AD1CON1_STRGSRC_POSITION                0x00000016
#define _AD1CON1_STRGSRC_MASK                    0x07C00000
#define _AD1CON1_STRGSRC_LENGTH                  0x00000005

#define _AD1CON1_FILTRDLY_POSITION               0x0000001B
#define _AD1CON1_FILTRDLY_MASK                   0xF8000000
#define _AD1CON1_FILTRDLY_LENGTH                 0x00000005

#define _AD1CON2_ADCDIV_POSITION                 0x00000000
#define _AD1CON2_ADCDIV_MASK                     0x0000007F
#define _AD1CON2_ADCDIV_LENGTH                   0x00000007

#define _AD1CON2_ADCSEL_POSITION                 0x00000008
#define _AD1CON2_ADCSEL_MASK                     0x00000300
#define _AD1CON2_ADCSEL_LENGTH                   0x00000002

